--------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Holly\Job Search\LMParticipation_PublicFiles\Log Output\SECTION 1 - Data Cleaning.log
  log type:  text
 opened on:  11 Jun 2025, 14:12:53

. 
. cd "D:\Holly\Job Search\LMParticipation_PublicFiles\DataPull_PSID"
D:\Holly\Job Search\LMParticipation_PublicFiles\DataPull_PSID

. use "FullData.dta", clear

. 
. *GENERATING PARTICIPANT ID 
. gen ParticipantID=((ER30001*1000)+ER30002)

. format ParticipantID %10.0g

. drop ER30001 ER30002

. 
. 
. ********************************************************************************
. ********************************************************************************
. *******************************  DATA CLEANING  ********************************
. ********************************************************************************
. ********************************************************************************
. **
. **TAS INDICATOR**
. **
. rename (TAS05 TAS07 TAS09 TAS11 TAS13 TAS15) ///
>            (TAS5 TAS7 TAS9 TAS11 TAS13 TAS15)

.         
. **
. **SEX**
. **
. rename ER32000 Sex

. recode Sex 2=0
(1748 changes made to Sex)

. label define sx 0"Female" 1"Male"

.         label value Sex sx

. 
.         /* Respondent gender, pulled from Individual Level Files
>                 0 = Female
>                 1 = Male
>         */
. 
. **
. **MARITAL STATUS**
. **
. rename (TA050069 TA070069 TA090078 TA110079 TA130078 TA150070) (mar5 mar7 mar9 mar11 mar13 mar15)

. rename (TA050072 TA070072 TA090081 TA110082 TA130081 TA150073) (co5 co7 co9 co11 co13 co15)

. 
. foreach x in 5 7 9 11 13 15 {
  2.         recode co`x' 0=. 9=. 8=. 5=0
  3.         recode mar`x' 9=.
  4.         }
(676 changes made to co5)
(0 changes made to mar5)
(968 changes made to co7)
(0 changes made to mar7)
(1329 changes made to co9)
(0 changes made to mar9)
(1610 changes made to co11)
(0 changes made to mar11)
(1526 changes made to co13)
(5 changes made to mar13)
(1369 changes made to co15)
(0 changes made to mar15)

.         
. label define relate 1"Single, never married" 2"Married" 3"Cohabitating, not married" 4"Widowed/divorced/separated"

. foreach x in 5 7 9 11 13 15 {
  2.         gen RelationshipStatus`x'=.
  3.         replace RelationshipStatus`x'=1 if mar`x'==2
  4.         replace RelationshipStatus`x'=2 if mar`x'==1    
  5.         replace RelationshipStatus`x'=3 if co`x'==1 & mar`x'!=1
  6.         replace RelationshipStatus`x'=4 if mar`x'==3 & RelationshipStatus`x'==. ///
>                 | mar`x'==4 & RelationshipStatus`x'==. ///
>                 | mar`x'==5 & RelationshipStatus`x'==.
  7.         label value RelationshipStatus`x' relate
  8.         label var RelationshipStatus`x' "Current relationship status"
  9.         }
(3,563 missing values generated)
(719 real changes made)
(24 real changes made)
(69 real changes made)
(2 real changes made)
(3,563 missing values generated)
(1,048 real changes made)
(59 real changes made)
(147 real changes made)
(6 real changes made)
(3,563 missing values generated)
(1,410 real changes made)
(121 real changes made)
(225 real changes made)
(17 real changes made)
(3,563 missing values generated)
(1,654 real changes made)
(201 real changes made)
(297 real changes made)
(38 real changes made)
(3,563 missing values generated)
(1,562 real changes made)
(198 real changes made)
(278 real changes made)
(26 real changes made)
(3,563 missing values generated)
(1,438 real changes made)
(164 real changes made)
(272 real changes made)
(24 real changes made)

.         
.         /* Current relationship status
>                 1 = Single, never married
>                 2 = Married
>                 3 = Cohabitating, not married (including previous divorced/separated/widowed)
>                 4 = Widowed/divorced/separated
>         */
. 
. **
. **RACE/ETHNICITY**
. **
. recode CHRACE 9=. 5/7=4
(135 changes made to CHRACE)

.         label define race 1"White" 2"Black" 3"Hispanic" 4"Other"

.         label value CHRACE race

.         label var CHRACE "Race/ethnicity"

.         rename CHRACE Race

.         
.         /* Respondent race, pulled from Childhood Development Supplement
>                 1 = White
>                 2 = Black
>                 3 = Hispanic
>                 4 = Other
>         */
. 
. **
. **AGE**
. **
. rename (ER33804 ER33904 ER34004 ER34104 ER34204 ER34305) (AGE5 AGE7 AGE9 AGE11 AGE13 AGE15)

. 
. foreach x in AGE5 AGE7 AGE9 AGE11 AGE13 AGE15 {
  2.         recode `x' 0=.
  3.         label var `x' "Age"
  4.         }
(307 changes made to AGE5)
(393 changes made to AGE7)
(445 changes made to AGE9)
(542 changes made to AGE11)
(619 changes made to AGE13)
(751 changes made to AGE15)

.         
.         /* Respondent age at wave
>                 17 - 31 : Actual values
>         */
.         
. **
. **HEALTH**
. **
. rename (TA050676 TA070647 TA090700 TA110788 TA130808 TA150821) ///
>            (Health5 Health7 Health9 Health11 Health13 Health15)

.            
. foreach x in 5 7 9 11 13 15 {
  2.         recode Health`x' 9 = .
  3.         label var Health`x' "Self-reported health level"
  4.         }
(2 changes made to Health5)
(3 changes made to Health7)
(1 changes made to Health9)
(4 changes made to Health11)
(0 changes made to Health13)
(2 changes made to Health15)

.         
.         /* Health level
>                 1 = Excellent 
>                 2 = Very good 
>                 3 = Good
>                 4 = Fair
>                 5 = Poor
>         */
. 
. 
. **
. **CHILDREN**
. **
. rename (TA050091 TA070091 TA090100 TA110101 TA130100 TA150092) ///
>            (NumKids5 NumKids7 NumKids9 NumKids11 NumKids13 NumKids15)

.           
. label define kids 0"0" 1"1" 2"2" 3"3" 4"4" 5"5" 6"6" 7"7" 8"8" 9"9" 10"10" 11"11" 12"12"

. foreach x in 5 7 9 11 13 15 {
  2.         recode NumKids`x' 98=. 99=.
  3.         label value NumKids`x' kids
  4.         label var NumKids`x' "Number of children"
  5.         }
(1 changes made to NumKids5)
(0 changes made to NumKids7)
(0 changes made to NumKids9)
(0 changes made to NumKids11)
(2 changes made to NumKids13)
(0 changes made to NumKids15)

.         
.         /* Number of children
>                 0 - 12 : Actual values
>         */
.         
.         *Creating dichotomous indicator of children
.         label define yn 0"No" 1"Yes"

.         foreach x in 5 7 9 11 13 15 {
  2.                 gen KidsYN`x'=.
  3.                 replace KidsYN`x'=0 if NumKids`x'==0
  4.                 replace KidsYN`x'=1 if NumKids`x'>=1 & NumKids`x'!=.
  5.                 label value KidsYN`x' yn
  6.                 label var KidsYN`x' "R has children, dichotomous"
  7.                 }
(3,563 missing values generated)
(645 real changes made)
(99 real changes made)
(3,563 missing values generated)
(904 real changes made)
(211 real changes made)
(3,563 missing values generated)
(1,198 real changes made)
(356 real changes made)
(3,563 missing values generated)
(1,398 real changes made)
(509 real changes made)
(3,563 missing values generated)
(1,335 real changes made)
(467 real changes made)
(3,563 missing values generated)
(1,211 real changes made)
(430 real changes made)

.                 
.         /* Respondent has children, any
>                 0 = No
>                 1 = Yes (1 or more)
>         */
.         
. **
. **EDUCATION
. **
. rename (TA091008 TA111150 TA131241 TA151301) ///
>            (HighestEd9 HighestEd11 HighestEd13 HighestEd15) 

.            *NOTE: Not available for 2005, 2007 waves
.            
. label define education 1"Less than high school" 2"High school or GED" 3"Some college, no degree" 4"2-year degree" 5"4-year deg
> ree" 6"Graduate or professional degree"

.         foreach x in 9 11 13 15 {
  2.                 recode HighestEd`x' 99=. 3=2 4/5=3 6/7=4 8/9=5 10/19=6
  3.                 label value HighestEd`x' education
  4.                 label var HighestEd`x' "Highest education"
  5.                 }
(1328 changes made to HighestEd9)
(1065 changes made to HighestEd11)
(1344 changes made to HighestEd13)
(819 changes made to HighestEd15)

.                 
.         *Code 96=Skipped, asked in prior wave
.         *Creating a loop to fill codes 96 with prior wave information
.         foreach x in 11 13 15 {
  2.                 local j = `x'-2
  3.                 replace HighestEd`x'=HighestEd`j' if HighestEd`x'==96 & HighestEd`j'!=.
  4.                 }
(642 real changes made)
(282 real changes made)
(702 real changes made)

.         recode HighestEd11 96=.
(1 changes made to HighestEd11)

.         recode HighestEd15 96=.
(8 changes made to HighestEd15)

.                 *Note: Two participants did not report education status in prior wave,
.                 *          but were coded as 96; have to code to missing data
.                 
.         /* Highest education
>                 1 = Less than high school
>                 2 = High school or equivalent
>                 3 = Some college, no degree attained
>                 4 = 2-year degree
>                 5 = 4-year degree
>                 6 = Graduate or profesional degree (including law, medical, masters, PhD, etc.)
>         */
.                 
. rename (TA050573 TA070548 TA090590 TA110671 TA130691 TA150701) ///
>            (GraduatedHS5 GraduatedHS7 GraduatedHS9 GraduatedHS11 GraduatedHS13 GraduatedHS15)

. 
. label define highschool 0"No degree" 1"High school degree" 2"GED"

. foreach x in 5 7 9 11 13 15 {
  2.         recode GraduatedHS`x' 0=96 3=0 8=. 9=.
  3.         label value GraduatedHS`x' highschool
  4.         label var GraduatedHS`x' "Graduated high school or received GED"
  5.         }
(98 changes made to GraduatedHS5)
(123 changes made to GraduatedHS7)
(154 changes made to GraduatedHS9)
(756 changes made to GraduatedHS11)
(389 changes made to GraduatedHS13)
(790 changes made to GraduatedHS15)

.         
.         *Code 96=Skipped, asked in prior wave
.         *Creating a loop to fill codes 96 with prior wave information
.         foreach x in 7 9 11 13 15 {
  2.                 local j = `x'-2
  3.                 replace GraduatedHS`x'=GraduatedHS`j' if GraduatedHS`x'==96 & GraduatedHS`j'!=.
  4.                 label value GraduatedHS`x' highschool
  5.                 }
(0 real changes made)
(0 real changes made)
(642 real changes made)
(282 real changes made)
(710 real changes made)

.         recode GraduatedHS11 96=.
(1 changes made to GraduatedHS11)

.                 *Note: One participant did not report graduation status in prior wave,
.                 *          but was coded as 96; have to code to missing data
.                 
.         /* Respondent graduated high school
>                 0 = No
>                 1 = Yes, high school degree
>                 2 = GED or other high school equivalent
>         */
. 
. /*rename (TA110689 TA130709 TA150719) ///
>            (GraduatedColg11 GraduatedColg13 GraduatedColg15)
>            *NOTE: Not available for the 2005, 2007, 2009 waves
>            
> label define college 1"2-year degree" 2"4-year degree" 3"Graduate or professional degree" 4"Other"
> foreach x in 11 13 15 {
>         recode GraduatedColg`x' 4/6=3 7=4 8=. 9=. 0=96
>         label value GraduatedColg`x' college
>         label var GraduatedColg`x' "College degree attained"
>         }
>         
>         *Code 96=Skipped, asked in prior wave
>         *Creating a loop to fill codes 96 with prior wave information
>         foreach x in 13 15 {
>                 local j = `x'-2
>                 replace GraduatedColg`x'=GraduatedColg`j' if GraduatedColg`x'==96 & GraduatedColg`j'!=.
>                 }
>                 
>         /* College degree attained
>                 1 = 2-year degree
>                 2 = 4-year degree
>                 3 = Graduate or professional degree
>                 4 = Other, unspecified
>         */
> 
> NOTE: Graduated college inconsistent in coding; need to determine where 96 codes
> come from before it can be used
>         */
.         
. **
. **ENROLLMENT STATUS
. **
. rename (TA050946 TA070927 TA090991 TA111133 TA131225 TA151285) ///
>            (EnrollNow5 EnrollNow7 EnrollNow9 EnrollNow11 EnrollNow13 EnrollNow15)

.         
. foreach x in 5 7 9 11 13 15 {
  2.         recode EnrollNow`x' 1/7=0 9/11=1 99=. 99=.
  3.         label value EnrollNow`x' yn
  4.         label var EnrollNow`x' "Enrolled at interview"
  5.         }
(745 changes made to EnrollNow5)
(1115 changes made to EnrollNow7)
(1554 changes made to EnrollNow9)
(1770 changes made to EnrollNow11)
(1746 changes made to EnrollNow13)
(1485 changes made to EnrollNow15)

. 
.         *Code 96=Skipped, asked in prior wave
.         *Creating a loop to fill codes 96 with prior wave information
.         foreach x in 7 9 11 13 15 {
  2.                 local j = `x'-2
  3.                 replace EnrollNow`x'=EnrollNow`j' if EnrollNow`x'==96 & EnrollNow`j'!=.
  4.                 }       
(0 real changes made)
(0 real changes made)
(134 real changes made)
(58 real changes made)
(156 real changes made)

.                 
.         *Note: 3 individuals in 2011 wave coded as 96 with no prior information on enrollment
.         *          Must be coded as missing, no other information available
.         recode EnrollNow11 96=.
(3 changes made to EnrollNow11)

.                 *"(EnrollNow11: 3 changes made)"
.                 
. 
. /*
> **UNEMPLOYMENT COMP
> **      
> rename (TA050411 TA070385 TA090416 TA110496 TA130516 TA150525) ///
>            (Comp5 Comp7 Comp9 Comp11 Comp13 Comp15)
>            
> foreach x in 5 7 9 11 13 15 {
>         recode Comp`x' 5=0 8/9=.
>         label value Comp`x' yn
>         label var Comp`x' "Received unemployment comp"
>         }          
> 
>         /* Whether received unemployment comp 
>                 0 = No
>                 1 = Year
>         */
> */      
.         
. **
. **DRUG AND ALCOHOL USE
. **
. rename (TA050715 TA070686 TA090742 TA110832 TA130855 TA150872) ///
>            (Alc_Diagnosis5 Alc_Diagnosis7 Alc_Diagnosis9 Alc_Diagnosis11 Alc_Diagnosis13 Alc_Diagnosis15)

. rename (TA050716 TA070687 TA090743 TA110833 TA130856 TA150873) ///
>            (Drug_Diagnosis5 Drug_Diagnosis7 Drug_Diagnosis9 Drug_Diagnosis11 Drug_Diagnosis13 Drug_Diagnosis15)

. rename (TA050766 TA070737 TA090796 TA110912 TA130945 TA150967) ///
>            (AlcUse5 AlcUse7 AlcUse9 AlcUse11 AlcUse13 AlcUse15)

.            
. 
. label define diag 0"Never diagnosed" 1"Diagnosed"

. foreach x in 5 7 9 11 13 15 {
  2.         recode AlcUse`x' 8/9 = . 5 = 0
  3.         label value AlcUse`x' yn
  4.         label var AlcUse`x' "Uses alcohol"
  5.         foreach y in Alc_Diagnosis Drug_Diagnosis {
  6.                 recode `y'`x' 8=. 9=.
  7.         label value `y'`x' diag
  8.         label var Alc_Diagnosis`x' "Diagnosed with alcohol use disorder"
  9.         label var Drug_Diagnosis`x' "Diagnosed with substance use disorder, not alcohol - substance not specified"
 10.                 }
 11.         }
(286 changes made to AlcUse5)
(2 changes made to Alc_Diagnosis5)
(2 changes made to Drug_Diagnosis5)
(433 changes made to AlcUse7)
(0 changes made to Alc_Diagnosis7)
(0 changes made to Drug_Diagnosis7)
(558 changes made to AlcUse9)
(1 changes made to Alc_Diagnosis9)
(1 changes made to Drug_Diagnosis9)
(684 changes made to AlcUse11)
(2 changes made to Alc_Diagnosis11)
(2 changes made to Drug_Diagnosis11)
(639 changes made to AlcUse13)
(2 changes made to Alc_Diagnosis13)
(2 changes made to Drug_Diagnosis13)
(586 changes made to AlcUse15)
(0 changes made to Alc_Diagnosis15)
(0 changes made to Drug_Diagnosis15)

. 
. **
. **RISKY BEHAVIOR**
. **
. rename (TA070836 TA090896 TA050855 TA111027 TA131062 TA151102) ///
>            (Dangerous7 Dangerous9 Dangerous5 Dangerous11 Dangerous13 Dangerous15)

. rename (TA050856 TA070837 TA131063 TA151103 TA090897 TA111028) ///
>            (Damaged5 Damaged7 Damaged13 Damaged15 Damaged9 Damaged11)

. rename (TA050857 TA070838 TA111029 TA151104 TA090898 TA131064) ///
>            (Fight5 Fight7 Fight11 Fight15 Fight9 Fight13)

. rename (TA050858 TA111030 TA070839 TA090899 TA131065 TA151105) ///
>            (DriveDrunk5 DriveDrunk11 DriveDrunk7 DriveDrunk9 DriveDrunk13 DriveDrunk15)

. rename (TA050859 TA070840 TA090900 TA131066 TA151106 TA111031) ///
>            (RodeDD5 RodeDD7 RodeDD9 RodeDD13 RodeDD15 RodeDD11)

. rename (TA151278 TA070920 TA090984 TA050939 TA111126 TA131218) ///
>            (Risky15 Risky7 Risky9 Risky5 Risky11 Risky13)

.         
. label define scale 1"1" 2"2" 3"3" 4"4" 5"5" 6"6" 7"7"

. foreach x in 5 7 9 11 13 15 {
  2.         foreach y in Dangerous Damaged Fight DriveDrunk RodeDD {
  3.                 recode `y'`x' 8=. 9=.
  4.                 recode Risky`x' 9=.
  5.                 label var Dangerous`x' "How often did something dangerous"
  6.                 label var Damaged`x' "How often damaged public property"
  7.                 label var Fight`x' "How often got into a physical fight"
  8.                 label var DriveDrunk`x' "How often drove when drunk or high"
  9.                 label var RodeDD`x' "How often rode with drunk driver"
 10.                 label var Risky`x' "Risky behavior scale"
 11.                 label value Risky`x' scale
 12.                 }
 13.         }
(0 changes made to Dangerous5)
(0 changes made to Risky5)
(0 changes made to Damaged5)
(0 changes made to Risky5)
(0 changes made to Fight5)
(0 changes made to Risky5)
(0 changes made to DriveDrunk5)
(0 changes made to Risky5)
(0 changes made to RodeDD5)
(0 changes made to Risky5)
(2 changes made to Dangerous7)
(2 changes made to Risky7)
(2 changes made to Damaged7)
(0 changes made to Risky7)
(2 changes made to Fight7)
(0 changes made to Risky7)
(2 changes made to DriveDrunk7)
(0 changes made to Risky7)
(3 changes made to RodeDD7)
(0 changes made to Risky7)
(6 changes made to Dangerous9)
(3 changes made to Risky9)
(3 changes made to Damaged9)
(0 changes made to Risky9)
(4 changes made to Fight9)
(0 changes made to Risky9)
(3 changes made to DriveDrunk9)
(0 changes made to Risky9)
(3 changes made to RodeDD9)
(0 changes made to Risky9)
(1 changes made to Dangerous11)
(0 changes made to Risky11)
(0 changes made to Damaged11)
(0 changes made to Risky11)
(0 changes made to Fight11)
(0 changes made to Risky11)
(0 changes made to DriveDrunk11)
(0 changes made to Risky11)
(0 changes made to RodeDD11)
(0 changes made to Risky11)
(2 changes made to Dangerous13)
(1 changes made to Risky13)
(0 changes made to Damaged13)
(0 changes made to Risky13)
(0 changes made to Fight13)
(0 changes made to Risky13)
(1 changes made to DriveDrunk13)
(0 changes made to Risky13)
(2 changes made to RodeDD13)
(0 changes made to Risky13)
(3 changes made to Dangerous15)
(3 changes made to Risky15)
(3 changes made to Damaged15)
(0 changes made to Risky15)
(3 changes made to Fight15)
(0 changes made to Risky15)
(3 changes made to DriveDrunk15)
(0 changes made to Risky15)
(3 changes made to RodeDD15)
(0 changes made to Risky15)

.         
.         /* Dangerous* Damaged* Fight* DriveDrunk* RodeDD* 
>                 7-point Likert scale
>                 1 = "Never"
>                 7 = "21 or more times"
>                 
>            Risky*
>             Average of all non-missing responses to above questions
>                 1 - 7 : Actual values
>         */
.         
. **
. **FINANCIAL RESPONSIBILITIES**
. **
. rename (TA050065 TA070065 TA090066 TA110067 TA130066 TA150066) ///
>            (WorryMoney5 WorryMoney7 WorryMoney9 WorryMoney11 WorryMoney13 WorryMoney15)

. rename (TA050066 TA070066 TA090067 TA110068 TA130067 TA150067) ///
>            (WorryJob5 WorryJob7 WorryJob9 WorryJob11 WorryJob13 WorryJob15)

. rename (TA050044 TA070044 TA090045 TA110046 TA130045 TA150045) ///
>            (FIN_Living5 FIN_Living7 FIN_Living9 FIN_Living11 FIN_Living13 FIN_Living15)

. rename (TA050045 TA070045 TA090046 TA110047 TA130046 TA150046) ///
>            (FIN_Rent5 FIN_Rent7 FIN_Rent9 FIN_Rent11 FIN_Rent13 FIN_Rent15)

. rename (TA050046 TA070046 TA090047 TA110048 TA130047 TA150047) ///
>            (FIN_Bills5 FIN_Bills7 FIN_Bills9 FIN_Bills11 FIN_Bills13 FIN_Bills15)

. rename (TA050047 TA070047 TA090048 TA110049 TA130048 TA150048) ///
>            (FIN_Money5 FIN_Money7 FIN_Money9 FIN_Money11 FIN_Money13 FIN_Money15)

. rename (TA050931 TA070912 TA090976 TA111118 TA131210 TA151270) ///
>            (FIN_Scale5 FIN_Scale7 FIN_Scale9 FIN_Scale11 FIN_Scale13 FIN_Scale15)

. rename (TA050050 TA070050 TA090051 TA110052 TA130051 TA150051) ///
>            (MoneyManage5 MoneyManage7 MoneyManage9 MoneyManage11 MoneyManage13 MoneyManage15)

. rename (TA050932 TA070913 TA090977 TA111119 TA131211 TA151271) ///
>            (Worry_Scale5 Worry_Scale7 Worry_Scale9 Worry_Scale11 Worry_Scale13 Worry_Scale15)

. rename (TA050067 TA070067 TA090068 TA110069 TA130068 TA150068) ///
>            (DiscgdOften5 DiscgdOften7 DiscgdOften9 DiscgdOften11 DiscgdOften13 DiscgdOften15)

. 
. foreach x in 5 7 9 11 13 15 {
  2.         foreach y in MoneyManage WorryMoney WorryJob Worry_Scale DiscgdOften {
  3.                 recode `y'`x' 8=. 9=. 
  4.                 label var WorryMoney`x' "How often wory about money"
  5.                 label var WorryJob`x' "How often worry about future job"
  6.                 label var MoneyManage`x' "How good at money management"
  7.                 label var DiscgdOften`x' "How often do you feel discouraged about the future"
  8.                 label value Worry_Scale`x' scale
  9.                 label var Worry_Scale`x' "Mental health scale - worry"
 10.                 }
 11.         }
(0 changes made to MoneyManage5)
(0 changes made to WorryMoney5)
(0 changes made to WorryJob5)
(2 changes made to Worry_Scale5)
(2 changes made to DiscgdOften5)
(0 changes made to MoneyManage7)
(0 changes made to WorryMoney7)
(0 changes made to WorryJob7)
(0 changes made to Worry_Scale7)
(0 changes made to DiscgdOften7)
(0 changes made to MoneyManage9)
(0 changes made to WorryMoney9)
(0 changes made to WorryJob9)
(0 changes made to Worry_Scale9)
(0 changes made to DiscgdOften9)
(0 changes made to MoneyManage11)
(0 changes made to WorryMoney11)
(0 changes made to WorryJob11)
(0 changes made to Worry_Scale11)
(0 changes made to DiscgdOften11)
(0 changes made to MoneyManage13)
(1 changes made to WorryMoney13)
(0 changes made to WorryJob13)
(1 changes made to Worry_Scale13)
(0 changes made to DiscgdOften13)
(0 changes made to MoneyManage15)
(0 changes made to WorryMoney15)
(0 changes made to WorryJob15)
(0 changes made to Worry_Scale15)
(0 changes made to DiscgdOften15)

. 
. foreach x in 5 7 9 11 13 15 {
  2.         foreach y in Living Rent Bills Money Scale {
  3.                 recode FIN_`y'`x' 8=. 9=. 
  4.                 recode FIN_Rent`x' 6=.s
  5.                 recode FIN_Bills`x' 6=.s
  6.                 label var FIN_Living`x' "How Much Responsibility for Earning Own Living"
  7.                 label var FIN_Rent`x' "How Much Responsibility for Paying Own Rent"
  8.                 label var FIN_Bills`x' "How Much Responsibility for Paying Own Bills"
  9.                 label var FIN_Money`x' "How much Responsibility for Managing Own Money"
 10.                 label var FIN_Scale`x' "Financial responsibilities scale"
 11.                 label value FIN_Scale`x' scale
 12.                 }
 13.         }
(0 changes made to FIN_Living5)
(97 changes made to FIN_Rent5)
(37 changes made to FIN_Bills5)
(2 changes made to FIN_Rent5)
(0 changes made to FIN_Rent5)
(0 changes made to FIN_Bills5)
(0 changes made to FIN_Bills5)
(0 changes made to FIN_Rent5)
(0 changes made to FIN_Bills5)
(0 changes made to FIN_Money5)
(0 changes made to FIN_Rent5)
(0 changes made to FIN_Bills5)
(23 changes made to FIN_Scale5)
(0 changes made to FIN_Rent5)
(0 changes made to FIN_Bills5)
(0 changes made to FIN_Living7)
(167 changes made to FIN_Rent7)
(44 changes made to FIN_Bills7)
(0 changes made to FIN_Rent7)
(0 changes made to FIN_Rent7)
(0 changes made to FIN_Bills7)
(0 changes made to FIN_Bills7)
(0 changes made to FIN_Rent7)
(0 changes made to FIN_Bills7)
(1 changes made to FIN_Money7)
(0 changes made to FIN_Rent7)
(0 changes made to FIN_Bills7)
(32 changes made to FIN_Scale7)
(0 changes made to FIN_Rent7)
(0 changes made to FIN_Bills7)
(2 changes made to FIN_Living9)
(106 changes made to FIN_Rent9)
(31 changes made to FIN_Bills9)
(1 changes made to FIN_Rent9)
(0 changes made to FIN_Rent9)
(0 changes made to FIN_Bills9)
(1 changes made to FIN_Bills9)
(0 changes made to FIN_Rent9)
(0 changes made to FIN_Bills9)
(1 changes made to FIN_Money9)
(0 changes made to FIN_Rent9)
(0 changes made to FIN_Bills9)
(17 changes made to FIN_Scale9)
(0 changes made to FIN_Rent9)
(0 changes made to FIN_Bills9)
(0 changes made to FIN_Living11)
(123 changes made to FIN_Rent11)
(37 changes made to FIN_Bills11)
(1 changes made to FIN_Rent11)
(0 changes made to FIN_Rent11)
(0 changes made to FIN_Bills11)
(1 changes made to FIN_Bills11)
(0 changes made to FIN_Rent11)
(0 changes made to FIN_Bills11)
(0 changes made to FIN_Money11)
(0 changes made to FIN_Rent11)
(0 changes made to FIN_Bills11)
(24 changes made to FIN_Scale11)
(0 changes made to FIN_Rent11)
(0 changes made to FIN_Bills11)
(0 changes made to FIN_Living13)
(131 changes made to FIN_Rent13)
(25 changes made to FIN_Bills13)
(9 changes made to FIN_Rent13)
(0 changes made to FIN_Rent13)
(0 changes made to FIN_Bills13)
(2 changes made to FIN_Bills13)
(0 changes made to FIN_Rent13)
(0 changes made to FIN_Bills13)
(0 changes made to FIN_Money13)
(0 changes made to FIN_Rent13)
(0 changes made to FIN_Bills13)
(22 changes made to FIN_Scale13)
(0 changes made to FIN_Rent13)
(0 changes made to FIN_Bills13)
(3 changes made to FIN_Living15)
(82 changes made to FIN_Rent15)
(22 changes made to FIN_Bills15)
(3 changes made to FIN_Rent15)
(0 changes made to FIN_Rent15)
(0 changes made to FIN_Bills15)
(2 changes made to FIN_Bills15)
(0 changes made to FIN_Rent15)
(0 changes made to FIN_Bills15)
(2 changes made to FIN_Money15)
(0 changes made to FIN_Rent15)
(0 changes made to FIN_Bills15)
(12 changes made to FIN_Scale15)
(0 changes made to FIN_Rent15)
(0 changes made to FIN_Bills15)

. 
.         /* WorryMoney* WorryJob*  
>                 7-point Likert scale
>                 1 = "Never"
>                 7 = "Daily"
>                 
>            Worry_Scale*
>             Average of all non-missing responses to above questions (plus "How often feel discouraged about future")
>                 1 - 7 : Actual values
>                 
>            FIN_Living* FIN_Rent* FIN_Bills* FIN_Money*
>             5-point Likert scale
>                 1 = Somebody else does this for me all of the time
>                 5 = I am completely responsible for this all the time
>                 .s = Not applicable; no bills to pay
>                 
>            FIN_Scale*
>             Average of all non-missing responses to above questions
>                 1 - 5 : Actual values
>                 
>            MoneyManage*
>                 7-point Likert scale
>                 1 = "Not at all well"
>                 7 = "Extremely well"
>         */
.         
. **
. **SOCIAL WELLBEING**
. **
. rename (TA050891 TA070872 TA090932 TA111064 TA131100 TA151140) ///
>            (WB_Contribute5 WB_Contribute7 WB_Contribute9 WB_Contribute11 WB_Contribute13 WB_Contribute15) // contribute

. rename (TA050892 TA070873 TA090933 TA111065 TA131101 TA151141) ///
>            (WB_Belong5 WB_Belong7 WB_Belong9 WB_Belong11 WB_Belong13 WB_Belong15) // belonging

. rename (TA050893 TA070874 TA090934 TA111066 TA131102 TA151142) ///
>            (WB_Better5 WB_Better7 WB_Better9 WB_Better11 WB_Better13 WB_Better15) // better

. rename (TA050894 TA070875 TA090935 TA111067 TA131103 TA151143) ///
>            (WB_Good5 WB_Good7 WB_Good9 WB_Good11 WB_Good13 WB_Good15) // good

. rename (TA050895 TA070876 TA090936 TA111068 TA131104 TA151144) ///
>            (WB_Sense5 WB_Sense7 WB_Sense9 WB_Sense11 WB_Sense13 WB_Sense15) // sense

. rename (TA050936 TA070917 TA090981 TA111123 TA131215 TA151275) ///
>            (WB_Scale5 WB_Scale7 WB_Scale9 WB_Scale11 WB_Scale13 WB_Scale15)

.            
. foreach x in 5 7 9 11 13 15 {
  2.         recode WB_Scale`x' 8=. 9=.
  3.         label var WB_Scale`x' "Social wellbeing scale"
  4.         label value WB_Scale`x' scale
  5.         }
(3 changes made to WB_Scale5)
(10 changes made to WB_Scale7)
(7 changes made to WB_Scale9)
(5 changes made to WB_Scale11)
(8 changes made to WB_Scale13)
(10 changes made to WB_Scale15)

. 
. foreach x in 5 7 9 11 13 15 {
  2.         foreach y in Contribute Belong Better Good Sense {
  3.                 recode WB_`y'`x' 8=. 9=. 
  4.                 label var WB_Contribute`x' "Frequency of Feeling Something to Contribute to Society"
  5.                 label var WB_Belong`x' "Frequency of Feeling Belonging to the Community"
  6.                 label var WB_Better`x' "Frequency of Feeling Society Getting Better"
  7.                 label var WB_Good`x' "Frequency of Feeling People Basically Good"
  8.                 label var WB_Sense`x' "Frequency of Feeling Way Society Works Makes Sense"
  9.                 }
 10.         }
(1 changes made to WB_Contribute5)
(0 changes made to WB_Belong5)
(2 changes made to WB_Better5)
(2 changes made to WB_Good5)
(2 changes made to WB_Sense5)
(4 changes made to WB_Contribute7)
(3 changes made to WB_Belong7)
(2 changes made to WB_Better7)
(4 changes made to WB_Good7)
(2 changes made to WB_Sense7)
(4 changes made to WB_Contribute9)
(3 changes made to WB_Belong9)
(3 changes made to WB_Better9)
(3 changes made to WB_Good9)
(5 changes made to WB_Sense9)
(0 changes made to WB_Contribute11)
(0 changes made to WB_Belong11)
(3 changes made to WB_Better11)
(1 changes made to WB_Good11)
(2 changes made to WB_Sense11)
(1 changes made to WB_Contribute13)
(1 changes made to WB_Belong13)
(5 changes made to WB_Better13)
(3 changes made to WB_Good13)
(4 changes made to WB_Sense13)
(5 changes made to WB_Contribute15)
(5 changes made to WB_Belong15)
(4 changes made to WB_Better15)
(3 changes made to WB_Good15)
(5 changes made to WB_Sense15)

. 
.         /* WB_Contribute* WB_Belong* WB_Better* WB_Good* WB_Sense
>                 6-point Likert scale
>                 1 = "Never"
>                 6 = "Every day"
>                 
>            WB_Scale*
>             Average of all non-missing responses to above questions
>                 1 - 6 : Actual values
>         */
. 
. **
. **PERCEIVED DISCRIMINATION**
. **
. rename (TA050826 TA070807 TA090866 TA110997 TA131032 TA151072) ///
>            (DIS_Courtesy5 DIS_Courtesy7 DIS_Courtesy9 DIS_Courtesy11 DIS_Courtesy13 DIS_Courtesy15) // courtesy

. rename (TA050827 TA070808 TA090867 TA110998 TA131033 TA151073) ///
>            (DIS_Service5 DIS_Service7 DIS_Service9 DIS_Service11 DIS_Service13 DIS_Service15) // service

. rename (TA050828 TA070809 TA090868 TA110999 TA131034 TA151074) ///
>            (DIS_Stupid5 DIS_Stupid7 DIS_Stupid9 DIS_Stupid11 DIS_Stupid13 DIS_Stupid15) // stupid

. rename (TA050829 TA070810 TA090869 TA111000 TA131035 TA151075) ///
>            (DIS_Afraid5 DIS_Afraid7 DIS_Afraid9 DIS_Afraid11 DIS_Afraid13 DIS_Afraid15) // afraid

. rename (TA050830 TA070811 TA090870 TA111001 TA131036 TA151076) ///
>            (DIS_Dishonest5 DIS_Dishonest7 DIS_Dishonest9 DIS_Dishonest11 DIS_Dishonest13 DIS_Dishonest15) // dishonest

. rename (TA050831 TA070812 TA090871 TA111002 TA131037 TA151077) ///
>            (DIS_Superior5 DIS_Superior7 DIS_Superior9 DIS_Superior11 DIS_Superior13 DIS_Superior15) // superior

. rename (TA050832 TA070813 TA090872 TA111003 TA131038 TA151078) ///
>            (DIS_Respect5 DIS_Respect7 DIS_Respect9 DIS_Respect11 DIS_Respect13 DIS_Respect15) // less respect

. rename (TA050943 TA070924 TA090988 TA111130 TA131222 TA151282) ///
>            (DIS_Scale5 DIS_Scale7 DIS_Scale9 DIS_Scale11 DIS_Scale13 DIS_Scale15)

. 
. foreach x in 5 7 9 11 13 15 {
  2.         foreach y in Courtesy Service Stupid Afraid Dishonest Superior Respect Scale {
  3.                 recode DIS_`y'`x' 8=. 9=.
  4.                 label var DIS_Respect`x' "How often treated with Less Respect"
  5.                 label var DIS_Courtesy`x' "How Often Treated with Less Courtesy"
  6.                 label var DIS_Service`x' "How Often Receive Poorer Service"
  7.                 label var DIS_Stupid`x' "How Often Others Treat as Stupid"
  8.                 label var DIS_Afraid`x' "How Often Others Act Afraid"
  9.                 label var DIS_Dishonest`x' "How Often Others Treat as Dishonest"
 10.                 label var DIS_Superior`x' "How Often Others Act Superior"
 11.                 label var DIS_Scale`x' "Everyday discrimination scale"
 12.                 label value DIS_Scale`x' scale
 13.                 }
 14.         }
(1 changes made to DIS_Courtesy5)
(0 changes made to DIS_Service5)
(0 changes made to DIS_Stupid5)
(1 changes made to DIS_Afraid5)
(0 changes made to DIS_Dishonest5)
(0 changes made to DIS_Superior5)
(0 changes made to DIS_Respect5)
(0 changes made to DIS_Scale5)
(3 changes made to DIS_Courtesy7)
(2 changes made to DIS_Service7)
(2 changes made to DIS_Stupid7)
(2 changes made to DIS_Afraid7)
(1 changes made to DIS_Dishonest7)
(1 changes made to DIS_Superior7)
(1 changes made to DIS_Respect7)
(1 changes made to DIS_Scale7)
(2 changes made to DIS_Courtesy9)
(1 changes made to DIS_Service9)
(1 changes made to DIS_Stupid9)
(1 changes made to DIS_Afraid9)
(1 changes made to DIS_Dishonest9)
(2 changes made to DIS_Superior9)
(2 changes made to DIS_Respect9)
(1 changes made to DIS_Scale9)
(0 changes made to DIS_Courtesy11)
(1 changes made to DIS_Service11)
(2 changes made to DIS_Stupid11)
(0 changes made to DIS_Afraid11)
(0 changes made to DIS_Dishonest11)
(1 changes made to DIS_Superior11)
(0 changes made to DIS_Respect11)
(0 changes made to DIS_Scale11)
(1 changes made to DIS_Courtesy13)
(1 changes made to DIS_Service13)
(1 changes made to DIS_Stupid13)
(0 changes made to DIS_Afraid13)
(2 changes made to DIS_Dishonest13)
(2 changes made to DIS_Superior13)
(1 changes made to DIS_Respect13)
(1 changes made to DIS_Scale13)
(4 changes made to DIS_Courtesy15)
(5 changes made to DIS_Service15)
(4 changes made to DIS_Stupid15)
(3 changes made to DIS_Afraid15)
(3 changes made to DIS_Dishonest15)
(5 changes made to DIS_Superior15)
(3 changes made to DIS_Respect15)
(3 changes made to DIS_Scale15)

. 
.         /* DIS_Courtesy* DIS_Service* DIS_Stupid* DIS_Afraid* DIS_Dishonest* DIS_Superior*
>                 6-point Likert scale
>                 1 = "Never"
>                 6 = "Almost every day"
>                 
>            DIS_Scale*
>             Average of all non-missing responses to above questions
>                 1 - 6 : Actual values
>         */
.         
. **
. **FUTURE PERCEPTIONS
. **
. rename (TA050640 TA070611 TA150785 TA110752 TA130772 TA090664) ///
>            (FUT_Support5 FUT_Support7 FUT_Support15 FUT_Support11 FUT_Support13 FUT_Support9) // support family

. rename (TA130773 TA050641 TA070612 TA150786 TA110753 TA090665) ///
>            (FUT_Layoff13 FUT_Layoff5 FUT_Layoff7 FUT_Layoff15 FUT_Layoff11 FUT_Layoff9) // layoff

. rename (TA110754 TA130774 TA070613 TA050642 TA090666 TA150787) ///
>            (FUT_Harder11 FUT_Harder13 FUT_Harder7 FUT_Harder5 FUT_Harder9 FUT_Harder15) // life harder parents

. rename (TA110764 TA050652 TA090676 TA130784 TA070623 TA150797) ///
>            (FUT_JobLike11 FUT_JobLike5 FUT_JobLike9 FUT_JobLike13 FUT_JobLike7 FUT_JobLike15) // job liked

. rename (TA150799 TA130786 TA050654 TA110766 TA090678 TA070625) ///
>            (FUT_Comfort15 FUT_Comfort13 FUT_Comfort5 FUT_Comfort11 FUT_Comfort9 FUT_Comfort7) // comfort

. 
. foreach x in 5 7 9 11 13 15 {
  2.         foreach y in Support Layoff Harder JobLike Comfort {
  3.                 recode FUT_`y'`x' 8=. 9=.
  4.                 label var FUT_Support`x' "How likely to be able to support family"
  5.                 label var FUT_Layoff`x' "How likely to be laid off from job"
  6.                 label var FUT_Harder`x' "How likely life will be harder than parents''"
  7.                 label var FUT_JobLike`x' "How likely to have the job you most lke"
  8.                 label var FUT_Comfort`x' "How likely to make enough money to be comfortable"
  9.                 }
 10.         }
(0 changes made to FUT_Support5)
(2 changes made to FUT_Layoff5)
(2 changes made to FUT_Harder5)
(8 changes made to FUT_JobLike5)
(0 changes made to FUT_Comfort5)
(2 changes made to FUT_Support7)
(1 changes made to FUT_Layoff7)
(2 changes made to FUT_Harder7)
(14 changes made to FUT_JobLike7)
(1 changes made to FUT_Comfort7)
(2 changes made to FUT_Support9)
(3 changes made to FUT_Layoff9)
(4 changes made to FUT_Harder9)
(6 changes made to FUT_JobLike9)
(1 changes made to FUT_Comfort9)
(0 changes made to FUT_Support11)
(1 changes made to FUT_Layoff11)
(0 changes made to FUT_Harder11)
(3 changes made to FUT_JobLike11)
(0 changes made to FUT_Comfort11)
(1 changes made to FUT_Support13)
(1 changes made to FUT_Layoff13)
(1 changes made to FUT_Harder13)
(1 changes made to FUT_JobLike13)
(0 changes made to FUT_Comfort13)
(1 changes made to FUT_Support15)
(3 changes made to FUT_Layoff15)
(1 changes made to FUT_Harder15)
(1 changes made to FUT_JobLike15)
(2 changes made to FUT_Comfort15)

.         
. **
. **JOB QUALITY AND SATISFACTION**
. **
. rename (TA050207 TA070225 TA090240 TA110242 TA130241 TA150233) ///
>            (SickDays5 SickDays7 SickDays9 SickDays11 SickDays13 SickDays15)

. rename (TA050208 TA070226 TA090241 TA110243 TA130242 TA150234) ///
>            (VacayDays5 VacayDays7 VacayDays9 VacayDays11 VacayDays13 VacayDays15)

. rename (TA050205 TA070223 TA090238 TA110240 TA130239 TA150231) ///
>            (InsuranceJob5 InsuranceJob7 InsuranceJob9 InsuranceJob11 InsuranceJob13 InsuranceJob15)

.            *Whether has insurance through job
. rename (TA070227 TA090242 TA110244 TA130243 TA150235) ///
>            (HIOffer7 HIOffer9 HIOffer11 HIOffer13 HIOffer15)

.            *Whether job offers health insurance
. rename (TA070228 TA090243 TA110245 TA130244 TA150236) ///
>            (HICould7 HICould9 HICould11 HICould13 HICould15)

.            *Whether could get insurance through job
. rename (TA050639 TA070610 TA090663 TA110751 TA130771 TA150784) ///
>            (LikelyPayWell5 LikelyPayWell7 LikelyPayWell9 LikelyPayWell11 LikelyPayWell13 LikelyPayWell15)

. rename (TA050206 TA070224 TA090239 TA110241 TA130240 TA150232) ///
>            (Retirement5 Retirement7 Retirement9 Retirement11 Retirement13 Retirement15)

. 
. foreach x in 5 7 9 11 13 15 {
  2.         foreach y in SickDays VacayDays InsuranceJob Retirement {
  3.                 recode `y'`x' 8=. 9=.
  4.                 label value `y'`x' yn
  5.                 label var SickDays`x' "Whether gets sick days from main job"
  6.                 label var VacayDays`x' "Whether gets vacation days from main job"
  7.                 label var InsuranceJob`x' "Whether has health insurance from main job"
  8.                 label var Retirement`x' "Whether has retirement from main job"
  9.                 }
 10.         recode LikelyPayWell`x' 8=. 9=. 0=.s
 11.         label value LikelyPayWell`x' scale
 12.         label var LikelyPayWell`x' "How likely to have a job that pays well"
 13.         }
(78 changes made to SickDays5)
(78 changes made to VacayDays5)
(78 changes made to InsuranceJob5)
(78 changes made to Retirement5)
(79 changes made to LikelyPayWell5)
(207 changes made to SickDays7)
(207 changes made to VacayDays7)
(205 changes made to InsuranceJob7)
(206 changes made to Retirement7)
(2 changes made to LikelyPayWell7)
(376 changes made to SickDays9)
(374 changes made to VacayDays9)
(377 changes made to InsuranceJob9)
(376 changes made to Retirement9)
(1 changes made to LikelyPayWell9)
(613 changes made to SickDays11)
(613 changes made to VacayDays11)
(612 changes made to InsuranceJob11)
(614 changes made to Retirement11)
(0 changes made to LikelyPayWell11)
(595 changes made to SickDays13)
(594 changes made to VacayDays13)
(594 changes made to InsuranceJob13)
(594 changes made to Retirement13)
(0 changes made to LikelyPayWell13)
(34 changes made to SickDays15)
(35 changes made to VacayDays15)
(34 changes made to InsuranceJob15)
(34 changes made to Retirement15)
(2 changes made to LikelyPayWell15)

. 
. foreach x in 7 9 11 13 15 {
  2.         recode HIOffer`x' 8=. 9=. 0=. 5=0
  3.                 label value HIOffer`x' yn
  4.         recode HICould`x' 8=. 9=. 0=. 5=0
  5.                 label value HICould`x' yn
  6.         label var HIOffer`x' "Does job offer health insurance"
  7.         label var HICould`x' "Could R get insurance through job"
  8.         }
(900 changes made to HIOffer7)
(1032 changes made to HICould7)
(1308 changes made to HIOffer9)
(1449 changes made to HICould9)
(1689 changes made to HIOffer11)
(1807 changes made to HICould11)
(1566 changes made to HIOffer13)
(1685 changes made to HICould13)
(1281 changes made to HIOffer15)
(1469 changes made to HICould15)

. 
. foreach x in 7 9 11 13 15 {
  2.         replace HIOffer`x' = 1 if InsuranceJob`x' == 1 
  3.         replace HIOffer`x' = 1 if HICould`x' == 1
  4.         }       
(176 real changes made)
(0 real changes made)
(174 real changes made)
(0 real changes made)
(265 real changes made)
(0 real changes made)
(239 real changes made)
(0 real changes made)
(557 real changes made)
(0 real changes made)

.         
. foreach x in 7 9 11 13 15 {
  2.         egen Benefits`x' = rowtotal(HIOffer`x' SickDays`x' VacayDays`x')
  3.         }       

. 
. foreach x in 7 9 11 13 15 {
  2.         replace Benefits`x' = . if TAS`x' == .
  3.         replace Benefits`x' = . if HIOffer`x' == . & SickDays`x' == . & VacayDays`x'==.
  4.         }       
(2,448 real changes made, 2,448 to missing)
(204 real changes made, 204 to missing)
(2,009 real changes made, 2,009 to missing)
(373 real changes made, 373 to missing)
(1,656 real changes made, 1,656 to missing)
(612 real changes made, 612 to missing)
(1,759 real changes made, 1,759 to missing)
(592 real changes made, 592 to missing)
(1,922 real changes made, 1,922 to missing)
(32 real changes made, 32 to missing)

. 
.         /* SickDays*
>                 0 = Job does not offers sick days
>                 1 = Job offer sick days
>                 
>            VacayDays*
>                 0 = Job does not offers vacation days
>                 1 = Job offer vacation days
>                 
>            HIOffer*
>                 0 = Job does not offer health insurance to employeers
>                 1 = Job does offer health insurance to employees
>                 
>            HICould*
>                 0 = R is not eligible to receive health insurance through job
>                 1 = R is eligible to receive health insurance through job
>                 
>            InsuranceJob*
>                 0 = R does not have insurance through main job
>                 1 = R has insurance through main job
>                 
>            Benefits*
>             Variety score
>                 0 = None
>                 3 = Sick days, vacation days, insurance
>                 
>            LikelyPayWell*
>                 7-point Likert scale
>                 1 = "Very unlikely"
>                 7 = "Very likely"       
>         */
.         
. **
. **FORCED SEPARATION FROM WORK
. **
. rename (TA050223 TA050258 TA050293 TA050328 TA050363) ///
>            (EndJobOne5 EndJobTwo5 EndJobThree5 EndJobFour5 EndJobFive5)

. rename (TA070255 TA070275 TA070295 TA070315 TA070335) ///
>            (EndJobOne7 EndJobTwo7 EndJobThree7 EndJobFour7 EndJobFive7)

. rename (TA090272 TA090292 TA090312 TA090332 TA090352) ///
>            (EndJobOne9 EndJobTwo9 EndJobThree9 EndJobFour9 EndJobFive9)

. rename (TA110262 TA110282 TA110302 TA110322 TA110342) ///
>            (EndJobOne11 EndJobTwo11 EndJobThree11 EndJobFour11 EndJobFive11)

. rename (TA130261 TA130281 TA130301 TA130321 TA130341) ///
>            (EndJobOne13 EndJobTwo13 EndJobThree13 EndJobFour13 EndJobFive13)

. rename (TA150255 TA150277 TA150299 TA150321 TA150343) ///
>            (EndJobOne15 EndJobTwo15 EndJobThree15 EndJobFour15 EndJobFive15)

.           
. foreach x in 5 7 9 11 13 15 {
  2.         gen ForceOut`x' = .
  3. }
(3,563 missing values generated)
(3,563 missing values generated)
(3,563 missing values generated)
(3,563 missing values generated)
(3,563 missing values generated)
(3,563 missing values generated)

. 
. foreach x in 5 7 9 11 13 15 {
  2.         foreach y in One Two Three Four Five {
  3.                 replace ForceOut`x' = 1 if EndJob`y'`x' == 1 | EndJob`y'`x' == 2 | ///
>                         EndJob`y'`x' == 6
  4.                 replace ForceOut`x' = 0 if ForceOut`x' != 1 & TAS`x' == 1
  5. }
  6. }
(52 real changes made)
(693 real changes made)
(70 real changes made)
(0 real changes made)
(39 real changes made)
(0 real changes made)
(9 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(13 real changes made)
(1,102 real changes made)
(20 real changes made)
(0 real changes made)
(7 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(15 real changes made)
(1,539 real changes made)
(27 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(13 real changes made)
(1,894 real changes made)
(27 real changes made)
(0 real changes made)
(14 real changes made)
(0 real changes made)
(7 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(14 real changes made)
(1,790 real changes made)
(23 real changes made)
(0 real changes made)
(11 real changes made)
(0 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(1,637 real changes made)
(17 real changes made)
(0 real changes made)
(6 real changes made)
(0 real changes made)
(5 real changes made)
(0 real changes made)
(4 real changes made)
(0 real changes made)

. 
.         /* ForceOut*
>                 0 = Did not experience a force out from work
>                 1 = Experienced a forced separation from work
>         */
. 
. **
. **EARNINGS
. **
. rename (TA050954 TA070935 TA090999 TA111141 TA131232 TA151292) ///
>            (EarningsLY5 EarningsLY7 EarningsLY9 EarningsLY11 EarningsLY13 EarningsLY15)

. rename (TA070936 TA091000 TA111142 TA131233 TA151293) ///
>            (EarningsBefore7 EarningsBefore9 EarningsBefore11 EarningsBefore13 EarningsBefore15)

.            *NOTE: No earnings year before last for 2005
.            
. foreach x in 7 9 11 13 15 {
  2.         foreach y in EarningsLY EarningsBefore {
  3.                 recode `y'`x' 9999999=. 0=.n
  4.                 }
  5.         recode EarningsLY5 9999999=. 0=.n
  6.         *No EarningsBefore for 2005
.         label var EarningsLY`x' "Earnings last year - excluding 0 values"
  7.                 label var EarningsLY5 "Earnings last year - excluding 0 values"
  8.         label var EarningsBefore`x' "Earnings year before last - excluding 0 values"
  9.         }
(286 changes made to EarningsLY7)
(483 changes made to EarningsBefore7)
(239 changes made to EarningsLY5)
(405 changes made to EarningsLY9)
(936 changes made to EarningsBefore9)
(0 changes made to EarningsLY5)
(697 changes made to EarningsLY11)
(1331 changes made to EarningsBefore11)
(0 changes made to EarningsLY5)
(625 changes made to EarningsLY13)
(1281 changes made to EarningsBefore13)
(0 changes made to EarningsLY5)
(481 changes made to EarningsLY15)
(1128 changes made to EarningsBefore15)
(0 changes made to EarningsLY5)

.         *NOTE: "don't know" and "refused" coded as missing by PSID
. 
.         /* EarningsLY* EarningsBefore*
>                 1 - 9,999,997 : Actual value
>                 .n = no labor earnings
>         */
.         
. **
. **OCCUPATION CODES
. **
. rename (TA050189 TA070207 TA090222 TA110223 TA130222 TA150214) ///
>            (OCC5 OCC7 OCC9 OCC11 OCC13 OCC15)

.            
. *       Recorded in later section
. 
.         
. **
. **UNEMPLOYMENT COMP
. **
. rename (TA050411 TA070385 TA090416 TA110496 TA130516 TA150525) ///
>            (UnemploymentComp5 UnemploymentComp7 UnemploymentComp9 UnemploymentComp11 UnemploymentComp13 UnemploymentComp15)

.            
. foreach x in 5 7 9 11 13 15 {
  2.         foreach y in UnemploymentComp {
  3.                 recode `y'`x' 8=. 9=. 5=0
  4.                 label value `y'`x' yn
  5.                 label var UnemploymentComp`x' "Received unemployment comp last year"
  6.                 }
  7.         }
(733 changes made to UnemploymentComp5)
(1093 changes made to UnemploymentComp7)
(1496 changes made to UnemploymentComp9)
(1825 changes made to UnemploymentComp11)
(1745 changes made to UnemploymentComp13)
(1614 changes made to UnemploymentComp15)

. 
.         /* UnemploymentComp*
>                 0 = R did not receive unemployment comp last year
>                 1 = R received unemployment comp last year
>         */
.         
. **
. **ARREST
. **
. **Ever arrested
. gen ArrestEver5 = TA050860
(2,818 missing values generated)

.         recode ArrestEver5 1 = 0 2/3 = 1 8 = . 9 = .
(745 changes made to ArrestEver5)

.                 
. gen ArrestEver7 = TA070841
(2,448 missing values generated)

.         recode ArrestEver7 1 = 0 2/3 = 1 8 = . 9 = .
(1115 changes made to ArrestEver7)

.         replace ArrestEver7 = 1 if ArrestEver5 == 1
(52 real changes made)

.                 
. gen ArrestEver9 = TA090901
(2,009 missing values generated)

.         recode ArrestEver9 1 = 0 2/3 = 1 8 = . 9 = .
(1554 changes made to ArrestEver9)

.         replace ArrestEver9 = 1 if ArrestEver7 == 1     
(108 real changes made)

.                 
. gen ArrestEver11 = TA111032
(1,656 missing values generated)

.         recode ArrestEver11 1 = 0 2/3 = 1 8 = . 9 = .
(1907 changes made to ArrestEver11)

.         replace ArrestEver11 = 1 if ArrestEver9 == 1            
(167 real changes made)

.                 
. gen ArrestEver13 = TA131067
(1,759 missing values generated)

.         recode ArrestEver13 1 = 0 2/3 = 1 8 = . 9 = .
(1804 changes made to ArrestEver13)

.         replace ArrestEver13 = 1 if ArrestEver11 == 1   
(363 real changes made)

.                 
. gen ArrestEver15 = TA151107
(1,922 missing values generated)

.         recode ArrestEver15 1 = 0 2/3 = 1 8 = . 9 = .
(1641 changes made to ArrestEver15)

.         replace ArrestEver15 = 1 if ArrestEver13 == 1
(516 real changes made)

.         
. foreach x in 5 7 9 11 13 15 {
  2.         replace ArrestEver`x' = . if TAS`x'!=1
  3.         }
(0 real changes made)
(28 real changes made, 28 to missing)
(49 real changes made, 49 to missing)
(73 real changes made, 73 to missing)
(262 real changes made, 262 to missing)
(431 real changes made, 431 to missing)

.         
. 
. *Age at first/last arrest
. rename (TA050862 TA070843 TA090903 TA111034 TA131069 TA151109) ///
>            (AgeFirstArrest5 AgeFirstArrest7 AgeFirstArrest9 AgeFirstArrest11 AgeFirstArrest13 AgeFirstArrest15)

.            
. rename (TA050861 TA070842 TA090902 TA111033 TA131068 TA151108) ///
>            (AgeOnlyArrest5 AgeOnlyArrest7 AgeOnlyArrest9 AgeOnlyArrest11 AgeOnlyArrest13 AgeOnlyArrest15)

.            
. rename (TA050864 TA070845 TA090905 TA111036 TA131071 TA151111) ///
>            (AgeLastArrest5 AgeLastArrest7 AgeLastArrest9 AgeLastArrest11 AgeLastArrest13 AgeLastArrest15)

.            
. foreach x in 5 7 9 11 13 15 {
  2.         recode AgeFirstArrest`x' 0=. 98=. 99=.
  3.         recode AgeOnlyArrest`x' 0=. 98=. 99=.
  4.         recode AgeLastArrest`x' 0=. 98=. 99=.
  5.         replace AgeFirstArrest`x'=AgeOnlyArrest`x' if AgeFirstArrest`x'==. & AgeOnlyArrest`x'!=.
  6.         replace AgeLastArrest`x'=AgeOnlyArrest`x' if AgeLastArrest`x'==. & AgeOnlyArrest`x'!=.
  7.         label var AgeFirstArrest`x' "Age at first arrest"
  8.         label var AgeLastArrest`x' "Age at last arrest"
  9.         }
(694 changes made to AgeFirstArrest5)
(653 changes made to AgeOnlyArrest5)
(694 changes made to AgeLastArrest5)
(92 real changes made)
(92 real changes made)
(1019 changes made to AgeFirstArrest7)
(979 changes made to AgeOnlyArrest7)
(1020 changes made to AgeLastArrest7)
(136 real changes made)
(136 real changes made)
(1399 changes made to AgeFirstArrest9)
(1371 changes made to AgeOnlyArrest9)
(1400 changes made to AgeLastArrest9)
(183 real changes made)
(183 real changes made)
(1711 changes made to AgeFirstArrest11)
(1659 changes made to AgeOnlyArrest11)
(1713 changes made to AgeLastArrest11)
(248 real changes made)
(248 real changes made)
(1647 changes made to AgeFirstArrest13)
(1595 changes made to AgeOnlyArrest13)
(1647 changes made to AgeLastArrest13)
(209 real changes made)
(209 real changes made)
(1490 changes made to AgeFirstArrest15)
(1480 changes made to AgeOnlyArrest15)
(1490 changes made to AgeLastArrest15)
(161 real changes made)
(161 real changes made)

.         
.         
. *Type of offense
. rename (TA050863 TA070844 TA090904 TA111035 TA131070 TA151110) ///
>            (OffFirstArrest5 OffFirstArrest7 OffFirstArrest9 OffFirstArrest11 OffFirstArrest13 OffFirstArrest15)

.            
. rename (TA131072 TA070846 TA090906 TA151112 TA111037 TA050865) ///
>            (OffLastArrest5 OffLastArrest7 OffLastArrest9 OffLastArrest11 OffLastArrest13 OffLastArrest15)

.            
. foreach x in 5 7 9 11 13 15 {
  2.         recode OffFirstArrest`x' 0=. 8=. 9=.
  3.         recode OffLastArrest`x' 0=. 8=. 9=.
  4.         replace OffLastArrest`x'=OffFirstArrest`x' if OffLastArrest`x'==. & OffFirstArrest`x'!=.
  5.         label var OffFirstArrest`x' "Offense type of first arrest"
  6.         label var OffLastArrest`x' "Offense type of last arrest"
  7.         }
(606 changes made to OffFirstArrest5)
(1650 changes made to OffLastArrest5)
(122 real changes made)
(892 changes made to OffFirstArrest7)
(1022 changes made to OffLastArrest7)
(133 real changes made)
(1237 changes made to OffFirstArrest9)
(1405 changes made to OffLastArrest9)
(174 real changes made)
(1484 changes made to OffFirstArrest11)
(1500 changes made to OffLastArrest11)
(356 real changes made)
(1458 changes made to OffFirstArrest13)
(1720 changes made to OffLastArrest13)
(263 real changes made)
(1342 changes made to OffFirstArrest15)
(696 changes made to OffLastArrest15)
(299 real changes made)

. 
.         
.         /* ArrestEver*
>                 0 = Never arrested
>                 1 = Previously arrested
>                 
>            AgeFirstArrest*
>            AgeLastArrest*
>                 1 - 30 : Actual values
>                 
>            OffFirstArrest*
>            OffLastArrest*
>             1 = Severe violent offense
>                 2 = Other severe offense
>                 3 = Non-severe offense 
>                 4 = Traffic violation 
>                 7 = Other offense
>         */
.         
. **
. **PROBATION
. **
. gen ProbationEver5 = TA050866
(2,818 missing values generated)

.         recode ProbationEver5 1 = 0 2/3 = 1 8 = . 9 = .
(143 changes made to ProbationEver5)

.    
. gen ProbationEver7 = TA070847
(2,448 missing values generated)

.         recode ProbationEver7 1 = 0 2/3 = 1 8 = . 9 = .
(237 changes made to ProbationEver7)

.         replace ProbationEver7 = 1 if ProbationEver5 == 1
(19 real changes made)

.  
. gen ProbationEver9 = TA090907
(2,009 missing values generated)

.         recode ProbationEver9 1 = 0 2/3 = 1 8 = . 9 = .
(341 changes made to ProbationEver9)

.         replace ProbationEver9 = 1 if ProbationEver7 == 1
(63 real changes made)

.                 
. gen ProbationEver11 = TA111038
(1,656 missing values generated)

.         recode ProbationEver11 1 = 0 2/3 = 1 8 = . 9 = .
(448 changes made to ProbationEver11)

.         replace ProbationEver11 = 1 if ProbationEver9 == 1
(112 real changes made)

.                 
. gen ProbationEver13 = TA131073
(1,759 missing values generated)

.         recode ProbationEver13 1 = 0 2/3 = 1 8 = . 9 = .
(370 changes made to ProbationEver13)

.         replace ProbationEver13 = 1 if ProbationEver11 == 1
(199 real changes made)

. 
. gen ProbationEver15 = TA151113
(1,922 missing values generated)

.         recode ProbationEver15 1 = 0 2/3 = 1 8 = . 9 = . 
(316 changes made to ProbationEver15)

.         replace ProbationEver15 = 1 if ProbationEver13 == 1 
(284 real changes made)

.         
. foreach x in 5 7 9 11 13 15 {
  2.         replace ProbationEver`x' = . if TAS`x'!=1
  3.         }
(0 real changes made)
(9 real changes made, 9 to missing)
(24 real changes made, 24 to missing)
(43 real changes made, 43 to missing)
(138 real changes made, 138 to missing)
(225 real changes made, 225 to missing)

.         
.         
. *Age at first/last probation
. rename (TA050868 TA070849 TA090909 TA111040 TA131075 TA151115) ///
>            (AgeFirstProbation5 AgeFirstProbation7 AgeFirstProbation9 AgeFirstProbation11 AgeFirstProbation13 AgeFirstProbation
> 15)

.            
. rename (TA050867 TA070848 TA090908 TA111039 TA131074 TA151114) ///
>            (AgeOnlyProbation5 AgeOnlyProbation7 AgeOnlyProbation9 AgeOnlyProbation11 AgeOnlyProbation13 AgeOnlyProbation15)

.            
. rename (TA050870 TA070851 TA090911 TA111042 TA131077 TA151117) ///
>            (AgeLastProbation5 AgeLastProbation7 AgeLastProbation9 AgeLastProbation11 AgeLastProbation13 AgeLastProbation15)

.            
. foreach x in 5 7 9 11 13 15 {
  2.         recode AgeFirstProbation`x' 0=. 98=. 99=.
  3.         recode AgeOnlyProbation`x' 0=. 98=. 99=.
  4.         recode AgeLastProbation`x' 0=. 98=. 99=.
  5.         replace AgeFirstProbation`x'=AgeOnlyProbation`x' if AgeFirstProbation`x'==. & AgeOnlyProbation`x'!=.
  6.         replace AgeLastProbation`x'=AgeOnlyProbation`x' if AgeLastProbation`x'==. & AgeOnlyProbation`x'!=.
  7.         label var AgeFirstProbation`x' "Age at first probation"
  8.         label var AgeLastProbation`x' "Age at last probation"
  9.         }
(736 changes made to AgeFirstProbation5)
(703 changes made to AgeOnlyProbation5)
(736 changes made to AgeLastProbation5)
(42 real changes made)
(42 real changes made)
(1088 changes made to AgeFirstProbation7)
(1031 changes made to AgeOnlyProbation7)
(1089 changes made to AgeLastProbation7)
(84 real changes made)
(84 real changes made)
(1526 changes made to AgeFirstProbation9)
(1427 changes made to AgeOnlyProbation9)
(1527 changes made to AgeLastProbation9)
(127 real changes made)
(127 real changes made)
(1861 changes made to AgeFirstProbation11)
(1761 changes made to AgeOnlyProbation11)
(1860 changes made to AgeLastProbation11)
(146 real changes made)
(146 real changes made)
(1766 changes made to AgeFirstProbation13)
(1668 changes made to AgeOnlyProbation13)
(1766 changes made to AgeLastProbation13)
(136 real changes made)
(136 real changes made)
(1609 changes made to AgeFirstProbation15)
(1537 changes made to AgeOnlyProbation15)
(1609 changes made to AgeLastProbation15)
(104 real changes made)
(104 real changes made)

.         
.         
. *Type of offense
. rename (TA050869 TA070850 TA090910 TA111041 TA131076 TA151116) ///
>            (OffFirstProbation5 OffFirstProbation7 OffFirstProbation9 OffFirstProbation11 OffFirstProbation13 OffFirstProbation
> 15)

.            
. rename (TA050871 TA070852 TA090912 TA111043 TA131078 TA151118) ///
>            (OffLastProbation5 OffLastProbation7 OffLastProbation9 OffLastProbation11 OffLastProbation13 OffLastProbation15)

.            
. foreach x in 5 7 9 11 13 15 {
  2.         recode OffFirstProbation`x' 0=. 8=. 9=.
  3.         recode OffLastProbation`x' 0=. 8=. 9=.
  4.         replace OffLastProbation`x'=OffFirstProbation`x' if OffLastProbation`x'==. & OffFirstProbation`x'!=.
  5.         label var OffFirstProbation`x' "Offense type of first probation"
  6.         label var OffLastProbation`x' "Offense type of last probation"
  7.         }
(697 changes made to OffFirstProbation5)
(737 changes made to OffLastProbation5)
(40 real changes made)
(1013 changes made to OffFirstProbation7)
(1090 changes made to OffLastProbation7)
(78 real changes made)
(1410 changes made to OffFirstProbation9)
(1528 changes made to OffLastProbation9)
(118 real changes made)
(1719 changes made to OffFirstProbation11)
(1861 changes made to OffLastProbation11)
(143 real changes made)
(1640 changes made to OffFirstProbation13)
(1767 changes made to OffLastProbation13)
(128 real changes made)
(1512 changes made to OffFirstProbation15)
(1611 changes made to OffLastProbation15)
(99 real changes made)

. 
.         
.         /* ProbationEver*
>                 0 = Never probationed
>                 1 = Previously probationed
>                 
>            AgeFirstProbation*
>            AgeLastProbation*
>                 1 - 30 : Actual values
>                 
>            OffFirstProbation*
>            OffLastProbation*
>             1 = Severe violent offense
>                 2 = Other severe offense
>                 3 = Non-severe offense 
>                 4 = Traffic violation 
>                 7 = Other offense
>         */
. 
.         
.         /* ProbationEver*
>                 0 = Never on probation
>                 1 = Previously on probation
>                 
>            AgeFirstProbation*
>            AgeLastProbation*
>                 1 - 30 : Actual values
>         */
.         
.         
. **
. **JAIL
. **
. gen JailEver5 = TA050872
(2,818 missing values generated)

.         recode JailEver5 1 = 0 2/3 = 1 8 = . 9 = .
(143 changes made to JailEver5)

.                 
. gen JailEver7 = TA070853
(2,448 missing values generated)

.         recode JailEver7 1 = 0 2/3 = 1 8 = . 9 = .
(237 changes made to JailEver7)

.         replace JailEver7 = 1 if JailEver5 == 1
(18 real changes made)

.         
. gen JailEver9 = TA090913
(2,009 missing values generated)

.         recode JailEver9 1 = 0 2/3 = 1 8 = . 9 = .
(341 changes made to JailEver9)

.         replace JailEver9 = 1 if JailEver7 == 1
(64 real changes made)

. 
. gen JailEver11 = TA111044
(1,656 missing values generated)

.         recode JailEver11 1 = 0 2/3 = 1 8 = . 9 = .
(448 changes made to JailEver11)

.         replace JailEver11 = 1 if JailEver9 == 1
(105 real changes made)

.                 
. gen JailEver13 = TA131079
(1,759 missing values generated)

.         recode JailEver13 1 = 0 2/3 = 1 8 = . 9 = .
(370 changes made to JailEver13)

.         replace JailEver13 = 1 if JailEver11 == 1
(188 real changes made)

.                 
. gen JailEver15 = TA151119
(1,922 missing values generated)

.         recode JailEver15 1 = 0 2/3 = 1 8 = . 9 = .
(316 changes made to JailEver15)

.         replace JailEver15 = 1 if JailEver13 == 1
(236 real changes made)

.         
. foreach x in 5 7 9 11 13 15 {
  2.         replace JailEver`x' = . if TAS`x'!=1
  3.         }
(0 real changes made)
(10 real changes made, 10 to missing)
(20 real changes made, 20 to missing)
(37 real changes made, 37 to missing)
(126 real changes made, 126 to missing)
(191 real changes made, 191 to missing)

.         
.         
. *Age at first/last jail
. rename (TA050874 TA070855 TA090915 TA111046 TA131081 TA151121) ///
>            (AgeFirstJail5 AgeFirstJail7 AgeFirstJail9 AgeFirstJail11 AgeFirstJail13 AgeFirstJail15)

.            
. rename (TA050873 TA070854 TA090914 TA111045 TA131080 TA151120) ///
>            (AgeOnlyJail5 AgeOnlyJail7 AgeOnlyJail9 AgeOnlyJail11 AgeOnlyJail13 AgeOnlyJail15)

.            
. rename (TA050876 TA070857 TA090917 TA111048 TA131083 TA151123) ///
>            (AgeLastJail5 AgeLastJail7 AgeLastJail9 AgeLastJail11 AgeLastJail13 AgeLastJail15)

.            
. foreach x in 5 7 9 11 13 15 {
  2.         recode AgeFirstJail`x' 0=. 98=. 99=.
  3.         recode AgeOnlyJail`x' 0=. 98=. 99=.
  4.         recode AgeLastJail`x' 0=. 98=. 99=.
  5.         replace AgeFirstJail`x'=AgeOnlyJail`x' if AgeFirstJail`x'==. & AgeOnlyJail`x'!=.
  6.         replace AgeLastJail`x'=AgeOnlyJail`x' if AgeLastJail`x'==. & AgeOnlyJail`x'!=.
  7.         label var AgeFirstJail`x' "Age at first jail"
  8.         label var AgeFirstJail`x' "Age at last jail"
  9.         }
(737 changes made to AgeFirstJail5)
(712 changes made to AgeOnlyJail5)
(737 changes made to AgeLastJail5)
(33 real changes made)
(33 real changes made)
(1089 changes made to AgeFirstJail7)
(1045 changes made to AgeOnlyJail7)
(1089 changes made to AgeLastJail7)
(70 real changes made)
(70 real changes made)
(1506 changes made to AgeFirstJail9)
(1487 changes made to AgeOnlyJail9)
(1506 changes made to AgeLastJail9)
(67 real changes made)
(67 real changes made)
(1853 changes made to AgeFirstJail11)
(1809 changes made to AgeOnlyJail11)
(1853 changes made to AgeLastJail11)
(98 real changes made)
(98 real changes made)
(1760 changes made to AgeFirstJail13)
(1735 changes made to AgeOnlyJail13)
(1760 changes made to AgeLastJail13)
(69 real changes made)
(69 real changes made)
(1600 changes made to AgeFirstJail15)
(1568 changes made to AgeOnlyJail15)
(1600 changes made to AgeLastJail15)
(73 real changes made)
(73 real changes made)

.         
.         
. *Type of offense
. rename (TA050875 TA070856 TA090916 TA111047 TA131082 TA151122) ///
>            (OffFirstJail5 OffFirstJail7 OffFirstJail9 OffFirstJail11 OffFirstJail13 OffFirstJail15)

.            
. rename (TA050877 TA070858 TA090918 TA111049 TA131084 TA151124) ///
>            (OffLastJail5 OffLastJail7 OffLastJail9 OffLastJail11 OffLastJail13 OffLastJail15)

.            
. foreach x in 5 7 9 11 13 15 {
  2.         recode OffFirstJail`x' 0=. 8=. 9=.
  3.         recode OffLastJail`x' 0=. 8=. 9=.
  4.         replace OffLastJail`x'=OffFirstJail`x' if OffLastJail`x'==. & OffFirstJail`x'!=.
  5.         label var OffFirstJail`x' "Offense type of first jail"
  6.         label var OffLastJail`x' "Offense type of last jail"
  7.         }
(708 changes made to OffFirstJail5)
(739 changes made to OffLastJail5)
(31 real changes made)
(1019 changes made to OffFirstJail7)
(1090 changes made to OffLastJail7)
(71 real changes made)
(1444 changes made to OffFirstJail9)
(1508 changes made to OffLastJail9)
(64 real changes made)
(1765 changes made to OffFirstJail11)
(1855 changes made to OffLastJail11)
(92 real changes made)
(1695 changes made to OffFirstJail13)
(1760 changes made to OffLastJail13)
(66 real changes made)
(1531 changes made to OffFirstJail15)
(1601 changes made to OffLastJail15)
(70 real changes made)

. 
.         
.         /* JailEver*
>                 0 = Never jailed
>                 1 = Previously jailed
>                 
>            AgeFirstJail*
>            AgeLastJail*
>                 1 - 30 : Actual values
>                 
>            OffFirstJail*
>            OffLastJail*
>             1 = Severe violent offense
>                 2 = Other severe offense
>                 3 = Non-severe offense 
>                 4 = Traffic violation 
>                 7 = Other offense
>         */
.         
.         
. **
. **TYPE OF OFFENSE SUPPLEMENT
. **
. 
. global lasto OffLastArrest11 OffLastArrest13 OffLastArrest15 OffLastArrest5 ///
>         OffLastArrest7 OffLastArrest9 OffLastJail11 OffLastJail13 OffLastJail15 ///
>         OffLastJail5 OffLastJail7 OffLastJail9 OffLastProbation11 OffLastProbation13 ///
>         OffLastProbation15 OffLastProbation5 OffLastProbation7 OffLastProbation9

. 
. foreach x in $lasto {
  2.         clonevar s_`x' = `x'
  3.         replace s_`x' = 0 if s_`x' == . 
  4.         }
(3,066 missing values generated)
(3,066 real changes made)
(3,113 missing values generated)
(3,113 real changes made)
(3,215 missing values generated)
(3,215 real changes made)
(3,287 missing values generated)
(3,287 real changes made)
(3,337 missing values generated)
(3,337 real changes made)
(3,240 missing values generated)
(3,240 real changes made)
(3,419 missing values generated)
(3,419 real changes made)
(3,453 missing values generated)
(3,453 real changes made)
(3,453 missing values generated)
(3,453 real changes made)
(3,526 missing values generated)
(3,526 real changes made)
(3,467 missing values generated)
(3,467 real changes made)
(3,453 missing values generated)
(3,453 real changes made)
(3,374 missing values generated)
(3,374 real changes made)
(3,398 missing values generated)
(3,398 real changes made)
(3,434 missing values generated)
(3,434 real changes made)
(3,515 missing values generated)
(3,515 real changes made)
(3,460 missing values generated)
(3,460 real changes made)
(3,419 missing values generated)
(3,419 real changes made)

. 
. foreach x in 5 7 9 11 13 15 {
  2.         replace s_OffLastArrest`x' = . if TAS`x' != 1
  3.         replace s_OffLastProbation`x' = . if TAS`x' != 1
  4.         replace s_OffLastJail`x' = . if TAS`x' != 1
  5.         }
(2,818 real changes made, 2,818 to missing)
(2,818 real changes made, 2,818 to missing)
(2,818 real changes made, 2,818 to missing)
(2,448 real changes made, 2,448 to missing)
(2,448 real changes made, 2,448 to missing)
(2,448 real changes made, 2,448 to missing)
(2,009 real changes made, 2,009 to missing)
(2,009 real changes made, 2,009 to missing)
(2,009 real changes made, 2,009 to missing)
(1,656 real changes made, 1,656 to missing)
(1,656 real changes made, 1,656 to missing)
(1,656 real changes made, 1,656 to missing)
(1,759 real changes made, 1,759 to missing)
(1,759 real changes made, 1,759 to missing)
(1,759 real changes made, 1,759 to missing)
(1,922 real changes made, 1,922 to missing)
(1,922 real changes made, 1,922 to missing)
(1,922 real changes made, 1,922 to missing)

. 
.         
.         
. cd "D:\Holly\Job Search\LMParticipation_PublicFiles\DataPull_PSID\Cleaned"
D:\Holly\Job Search\LMParticipation_PublicFiles\DataPull_PSID\Cleaned

. save "CleanedCov.dta", replace
file CleanedCov.dta saved

. 
. log close
      name:  <unnamed>
       log:  D:\Holly\Job Search\LMParticipation_PublicFiles\Log Output\SECTION 1 - Data Cleaning.log
  log type:  text
 closed on:  11 Jun 2025, 14:12:55
--------------------------------------------------------------------------------------------------------------------------------
